export function normalizeProfessionKey(value = "") {


    return String(value)

        .toLowerCase()


        // убираем служебные слова
        .replace(
            /инструкция|иот|по охране труда|охрана труда|для|работник|работы|рабочий/g,
            " "
        )


        // нормализуем основные варианты
        .replace(
            /электрик|электромонтажник|электромонтер/g,
            "электромонтер"
        )


        .replace(
            /водитель автомобиля|водитель/g,
            "водитель"
        )


        .replace(
            /уборщица|уборщик помещений|уборщик/g,
            "уборщик"
        )


        .replace(
            /слесарь по ремонту|слесарь ремонтник/g,
            "слесарь"
        )


        // удаляем лишние символы
        .replace(
            /[^а-яa-z0-9\s]/gi,
            " "
        )


        // нормальные пробелы
        .replace(
            /\s+/g,
            " "
        )


        .trim();

}